Importing Libraries that we will be using while doing this projects.

In [98]:
import pandas as pd
import numpy as np
import os 
import opendatasets as od
import warnings
warnings.filterwarnings("ignore")

Importing datasets directly from kaggle website that we will be using doing this project

In [99]:
datasets='https://www.kaggle.com/datasets/arashnic/book-recommendation-dataset/data'

In [100]:
od.download(datasets)

Skipping, found downloaded files in ".\book-recommendation-dataset" (use force=True to force download)

In [101]:
data_dir='.\\book-recommendation-dataset'

In [102]:
os.listdir(data_dir)

['Books.csv', 'Ratings.csv', 'recsys_taxonomy2.png', 'Users.csv']

In [103]:
books_data=pd.read_csv('book-recommendation-dataset\Books.csv')

In [104]:
ratings_data=pd.read_csv('book-recommendation-dataset\Ratings.csv')

In [105]:
users_data=pd.read_csv('book-recommendation-dataset\\Users.csv')

In [106]:
ratings_data.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [107]:
users_data.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

Lets do some analysis of the given data.

In [108]:
#Lets start with books data
books_data.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [109]:
#Here firstly lets change and save the changed  titles of the columns so that it will be easier for us to acess it .

books_data.rename(columns=({
    'Book-Title':'title',
    'Book-Author':'author',
    'Year-Of-Publication':'publication',
    'Image-URL-L':'image'
}),inplace=True)

here we can see there are 3 images url it is not compoulsory to keep three of them one is enough so lets
take any one of them ie large

In [110]:
books_data=books_data.drop(['Image-URL-S','Image-URL-M'],axis =1)

In [111]:
books_data.head(1)

,ISBN,title,author,publication,Publisher,image
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...

In [112]:
#it is looking neet and clean isnt is?

In [114]:
books_data.shape

(271360, 6)

In [125]:
#there are more than 2.5lacs books.
#lets now see Users data

In [127]:
users_data.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

In [129]:
#lets change the columns name of userid and save it

In [132]:
users_data.rename(columns={
    'User-ID':'user_id'
},inplace=True)

In [134]:
users_data.shape

(278858, 3)

From this we can see there are some missing values in ourdatasets we will be handeling it later

In [137]:
ratings_data.head()

   user_id        ISBN  ratings
0   276725  034545104X        0
1   276726  0155061224        5
2   276727  0446520802        0
3   276729  052165615X        3
4   276729  0521795028        6

In [138]:
#lets change it columns name also and save it.

In [119]:
ratings_data.rename(columns={
    'User-ID':'user_id',
    'Book-Rating':'ratings'
},inplace=True)

In [120]:
ratings_data.head(1)

   user_id        ISBN  ratings
0   276725  034545104X        0

In [123]:
ratings_data.shape

(1149780, 3)

ratings data is more than that of the books this can be because one users can rate the multiple books lets
find it out

In [139]:
# lets see how many users has rated how many times

In [145]:
ratings_data['user_id'].value_counts()

11676     13602
198711     7550
153662     6109
98391      5891
35859      5850
          ...
116180        1
116166        1
116154        1
116137        1
276723        1
Name: user_id, Length: 105283, dtype: int64

here we can clearly see that one users has rated more than 13k times and some have rated only one times
so we can take a users that has rated at least certain times/books so that our model can perform well and reduces curse of dimensionlaity.we will be following the following steps

In [146]:
#firstly we will be finding the users who has done at least 100 ratings and we will be updating the raitng_data accordingle
#second we will be merging that updated rating columns into the books_data.
#And we will be finding which books has got how many ratings and will be not taking which has got not pretty much less rating
#Lastely we will be updating the final data accordingly.

In [149]:
A=ratings_data['user_id'].value_counts()>100

In [155]:
A[A].shape

(1825,)

In [156]:
A.shape

(105283,)

In [157]:
#we can see that  only 1825 people has done rating more than 100 times
#lets find out it index of peope who has rated more than 100 time and merge in our rating datasets

In [159]:
B=A[A].index

In [160]:
B

Int64Index([ 11676, 198711, 153662,  98391,  35859, 212898, 278418,  76352,
            110973, 235105,
            ...
            238186,  99441, 187410, 262070,  70183,  40553,  39345, 266283,
            189666, 140879],
           dtype='int64', length=1825)

In [162]:
ratings_data=ratings_data[ratings_data['user_id'].isin (B)]

In [163]:
ratings_data

         user_id        ISBN  ratings
412       276925  0006511929        0
413       276925  002542730X       10
414       276925  0060520507        0
415       276925  0060930934        0
416       276925  0060951303        0
...          ...         ...      ...
1149633   276680  1884910033        0
1149634   276680  1888173408        7
1149635   276680  1888173564        8
1149636   276680  1888173572        0
1149637   276680  1931561648        9

[656605 rows x 3 columns]

In [165]:
#lets cross check it

In [166]:
ratings_data['user_id'].value_counts()

11676     13602
198711     7550
153662     6109
98391      5891
35859      5850
          ...
70183       101
65584       101
238186      101
39345       101
20119       101
Name: user_id, Length: 1825, dtype: int64

In [167]:
ratings_data.shape

(656605, 3)

In [168]:
#we can see now our ratings data compressed to around 6lac

Pretty much good going well

In [170]:
new_ratings=ratings_data.merge(books_data,on='ISBN')

#here we have merged our ratings_data with books_data on ISBN because it is present in both datasets

In [171]:
new_ratings

,user_id,ISBN,ratings,title,author,publication,Publisher,image
0,276925,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,http://images.amazon.com/images/P/002542730X.0...
1,277427,002542730X,10,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,http://images.amazon.com/images/P/002542730X.0...
2,3363,002542730X,0,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,http://images.amazon.com/images/P/002542730X.0...
3,10030,002542730X,7,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,http://images.amazon.com/images/P/002542730X.0...
4,11676,002542730X,6,Politically Correct Bedtime Stories: Modern Ta...,James Finn Garner,1994,John Wiley &amp; Sons Inc,http://images.amazon.com/images/P/002542730X.0...
...,...,...,...,...,...,...,...,...
604849,276680,089587167X,7,Something Blue,Jean Christopher Spaugh,1997,John F. Blair Publisher,http://images.amazon.com/images/P/089587167X.0...
604850,276680,1402201435,4,The One True Ocean,Sarah Beth Martin,2003,Sourcebooks Landmark,http://images.amazon.com/images/P/1402201435.0...
604851,276680,1564407284,0,"The Old Sturbridge Village Cookbook, 2nd : Aut...",Caroline Sloat,1995,Globe Pequot,http://images.amazon.com/images/P/1564407284.0...
604852,276680,1582343594,0,City of Masks : A Cree Black Novel,Daniel Hecht,2004,Bloomsbury USA,http://images.amazon.com/images/P/1582343594.0...
604853,276680,1888173408,7,Fairy Tale (Common Reader Editions),Alice Thomas Ellis,2001,Akadine Press,http://images.amazon.com/images/P/1888173408.0...

In [174]:
new_ratings.shape

(604854, 8)

In [175]:
#shape before merging and after merging is not same it indicates that there were some missing values.